{
  "schema_version": "pdp_json_v1",
  "peptide": {
    "canonical_name": "Retatrutide",
    "short_name": "Retatrutide",
    "aliases": [
      "glp 3",
      "glp-3",
      "glp3",
      "ly3437943",
      "reta",
      "triple g"
    ],
    "classification": {
      "category": "investigational_human",
      "needs_prescription": false,
      "notes": ""
    },
    "status": {
      "category": "investigational_human",
      "jurisdiction": "GLOBAL",
      "last_reviewed": "2026-01-19",
      "human_use_note": ""
    },
    "structure": {
      "sequence_oneletter": "",
      "amino_acid_seq": "",
      "molecular_formula": "",
      "molecular_weight": null,
      "structure_image_url": ""
    },
    "risk": {
      "current_score": 5,
      "severity": "moderate",
      "likelihood": "possible",
      "evidence_grade": "unknown",
      "developmental_risk": true,
      "unknowns_penalty": true,
      "rationale": "",
      "risk_score": 5
    },
    "sections": {
      "overview": [
        {
          "claim_type": "overview",
          "title": "What it is",
          "population_group": null,
          "confidence": null,
          "evidence_grade": null,
          "text": "Retatrutide is a newer “triple-agonist” peptide that targets three hormone receptors involved in appetite, blood sugar regulation, and energy balance (GLP-1, GIP, and glucagon). People usually compare it to GLP-1 medications — but with an added pathway that may change how strong the effects feel.",
          "evidence_refs": []
        },
        {
          "claim_type": "overview",
          "title": "What people are trying to get from it",
          "population_group": null,
          "confidence": null,
          "evidence_grade": null,
          "text": "Most interest is about fat-loss and metabolic improvement — especially stronger appetite control and easier adherence to a calorie deficit. The real-world tradeoff is tolerability: if your intake drops too hard, the practical issues show up fast (nausea, constipation, fatigue, dehydration, and losing muscle if protein falls).",
          "evidence_refs": []
        }
      ],
      "use_cases": [
        {
          "claim_type": "use_case",
          "title": "What it commonly feels like",
          "population_group": null,
          "confidence": null,
          "evidence_grade": null,
          "text": "The most commonly discussed effects are reduced appetite, smaller portions without feeling like you’re fighting yourself, and easier consistency with nutrition. Many people also talk about fewer cravings and less impulsive eating.",
          "evidence_refs": []
        },
        {
          "claim_type": "use_case",
          "title": "Nutrition considerations",
          "population_group": null,
          "confidence": null,
          "evidence_grade": null,
          "text": "If appetite drops hard, protein is the #1 thing people accidentally under-shoot — and that’s where fatigue and muscle loss can sneak in during aggressive weight loss. Constipation is also common, so hydration + fiber matter more than people expect. If nausea shows up, smaller meals and simpler foods are usually easier.",
          "evidence_refs": []
        },
        {
          "claim_type": "use_case",
          "title": "Fitness & performance considerations",
          "population_group": null,
          "confidence": null,
          "evidence_grade": null,
          "text": "This tends to work best when you keep training consistent. Resistance training matters most for protecting strength and lean mass. If calories crash too low, performance and recovery can dip — so adjust volume realistically instead of trying to train like you’re fully fed.",
          "evidence_refs": []
        },
        {
          "claim_type": "use_case",
          "title": "What’s still uncertain (simple version)",
          "population_group": null,
          "confidence": null,
          "evidence_grade": null,
          "text": "Retatrutide has strong early human trial results, but the long-term story (durability, safety, and who benefits most) is still being defined. Expect the guidance to sharpen as more data accumulates.",
          "evidence_refs": []
        }
      ],
      "mechanism": [],
      "human_effects": [],
      "preclinical_effects": [],
      "hypothesized_effects": [],
      "time_dynamics": [],
      "risks": [],
      "contraindications": [],
      "monitoring": [],
      "observed_exposure_ranges": [
        {
          "route": "",
          "unit": "",
          "min": null,
          "max": null,
          "frequency": "",
          "duration": "",
          "population_group": "general",
          "notes": "Descriptive only. Observed in studies; not instructions.",
          "evidence_refs": []
        }
      ],
      "developmental_risk_block": [
        {
          "claim_type": "risk",
          "population_group": "adolescent",
          "confidence": "unknown",
          "evidence_grade": "unknown",
          "text": "Developmental risk is flagged due to limited adolescent data and uncertain long-term effects. Endocrine, growth, neurodevelopmental, and metabolic setpoints may be sensitive to perturbation. This section is descriptive only; uncertainty is explicitly acknowledged.",
          "evidence_refs": []
        }
      ],
      "interaction_summary": [
        {
          "title": "Key interaction flags",
          "text": "The highest-priority interactions are with insulin and other blood sugar medications — appetite suppression can cause blood sugar to drop harder than expected, and doses often need to come down as weight loss progresses."
        },
        {
          "text": "Do not stack with other GLP-1 medications like semaglutide or tirzepatide. Retatrutide already covers the same receptor — adding another creates overlapping side effects with no benefit."
        },
        {
          "text": "Opioid pain medications and retatrutide both slow gut motility. Combined, constipation can become severe. If you’re on opioids, aggressive bowel management (stool softeners, high hydration) is essential from day one."
        },
        {
          "text": "Blood pressure medications may need adjusting as you lose weight — significant weight loss reliably lowers blood pressure, which can mean your current dose becomes too strong over time."
        },
        {
          "text": "If you’re on blood thinners like warfarin, changing eating patterns affects how warfarin works. More frequent monitoring is warranted during active weight loss."
        }
      ],
      "current_outlook_bullets": [
        "Quiet “food noise” and make eating feel simpler",
        "Drive meaningful fat loss in an obesity/metabolic context",
        "Improve glucose control markers in research settings",
        "See whether “triple agonist” feels different than GLP-1 alone",
        "Lose fat without letting energy and lean mass collapse"
      ]
    },
    "evidence": [
      {
        "id": "E1",
        "title": "Pep-Talk curation pending: we’re reviewing the evidence and will expand this section soon.",
        "source_type": "pubmed",
        "source_id": "E1",
        "url": "",
        "published_date": "",
        "evidence_grade": "unknown",
        "notes": "Curation note: this entry will be replaced with properly cited trial and safety references after review."
      }
    ],
    "changelog": [
      {
        "date": "2026-01-19",
        "change_type": "initial_entry",
        "summary": "Initial canonical entry for Retatrutide",
        "detail": "Generated from queue ingestion (Phase 6). Requires human-authored, evidence-bounded content.",
        "evidence_refs": []
      }
    ],
    "needs_prescription": false,
    "meta": {
      "priority": "high",
      "notes_seed": "GLP-1/GIP/GCGR tri-agonist; investigational; avoid protocol claims"
    },
    "topics": {
      "primary": [
        "topic_fat_loss_metabolism"
      ]
    },
    "slug": "retatrutide"
  },
  "canonical_name": "Retatrutide",
  "interactions": {
    "drug_classes": [
      { "name": "Insulin & blood sugar medications", "risk_note": "Appetite suppression reduces food intake — blood sugar can drop harder than expected. Monitor closely and expect dose adjustments as weight loss progresses." },
      { "name": "GLP-1 agonists (semaglutide, tirzepatide)", "risk_note": "Do not stack. Retatrutide already covers GLP-1 receptors — adding another GLP-1 agonist compounds side effects with no added benefit." },
      { "name": "Opioid pain medications", "risk_note": "Both slow gut motility. Combined constipation risk is severe. Aggressive bowel management required from day one." },
      { "name": "Blood pressure medications", "risk_note": "Weight loss lowers blood pressure — current dose may become too strong as weight drops. Monitor BP regularly." },
      { "name": "Blood thinners (warfarin)", "risk_note": "Dietary changes from appetite suppression affect how warfarin works. More frequent INR monitoring warranted." }
    ],
    "supplement_classes": [
      { "name": "Fat burners / thermogenics", "risk_note": "Do not combine. Stacked appetite suppression and cardiovascular stress with no proportionate benefit." }
    ],
    "notes": []
  },
  "practical": {
    "schema_version": "practical_block_v1",
    "bottom_line": "Retatrutide is an investigational tri-agonist (GLP-1/GIP/glucagon receptors) being studied for obesity and metabolic disease. In controlled human studies it produces substantial weight loss and improves metabolic markers. The practical risk is not mystery — it’s tolerability (GI side effects), dehydration/constipation, and unintentional under-eating that drives fatigue and lean-mass loss.",
    "benefits": [
      "Reduce appetite and “food noise” in a way many people notice quickly",
      "Support significant weight loss in controlled studies",
      "Improve glycemic and cardiometabolic markers in research settings",
      "Make calorie deficits feel more “automatic” for some users"
    ],
    "side_effects_common": [
      "nausea, reflux, or stomach discomfort",
      "constipation or slower GI motility",
      "diarrhea or unpredictable bowel changes",
      "fatigue / low energy during adjustment",
      "reduced appetite beyond what feels healthy"
    ],
    "side_effects_serious": [
      "persistent vomiting or dehydration (dizziness, inability to keep fluids down)",
      "severe abdominal pain that doesn’t settle (needs urgent evaluation)",
      "gallbladder complications in incretin contexts (upper-right abdominal pain, fever, jaundice)",
      "hypoglycemia risk when combined with other glucose-lowering agents"
    ],
    "who_should_be_cautious": [
      "people with a history of pancreatitis or gallbladder disease",
      "individuals with significant GI motility issues (severe reflux, gastroparesis-like symptoms)",
      "those with eating-disorder history or active restrictive patterns",
      "people using insulin or insulin secretagogues (higher hypoglycemia risk)",
      "anyone stacking multiple metabolic agents (risk compounds fast)"
    ]
  },
  "sections": {
    "overview": [
      {
        "heading": "What it is",
        "text": "Retatrutide is an investigational “triple-agonist” peptide designed to act on three hormone pathways involved in appetite, blood sugar control, and energy balance (GLP-1, GIP, and glucagon receptors). It’s being studied primarily for obesity and metabolic disease."
      },
      {
        "heading": "Big picture",
        "text": "Most interest centers on the possibility of larger fat-loss and stronger metabolic effects than earlier incretin therapies. The practical tradeoff is tolerability: GI side effects can be meaningful, and long-term safety is still being defined as the research matures."
      }
    ],
    "current_outlook_bullets": [
      "Quiet “food noise” and make eating feel simpler",
      "Drive meaningful fat loss in an obesity/metabolic context",
      "Improve glucose control markers in research settings",
      "See whether “triple agonist” feels different than GLP-1 alone",
      "Lose fat without letting energy and lean mass collapse"
    ],
    "use_cases": [
      {
        "heading": "What people usually notice",
        "text": "The most commonly described changes are: appetite feels quieter, portions shrink naturally, and cravings become easier to ignore. In research contexts, improvements show up in weight and metabolic markers. The experience varies — especially depending on how hard intake drops."
      },
      {
        "heading": "Nutrition considerations",
        "text": "If appetite drops sharply, under-eating protein becomes the most common “silent” mistake—especially during aggressive fat loss. Hydration and fiber matter because constipation and GI slowdown are common practical issues people report with this class. If nausea shows up, simpler foods and smaller meals are often easier to tolerate."
      },
      {
        "heading": "Fitness & performance considerations",
        "text": "Results are typically better when paired with consistent training. Resistance work is especially relevant during weight loss to help preserve strength and lean mass. If food intake drops too low, fatigue and performance dips are common—so training volume and recovery need to stay realistic."
      },
      {
        "heading": "What’s still being figured out",
        "text": "Retatrutide has real human trial data behind it, but the long-term safety profile, durability, and best-fit populations are still being defined. As this moves through the research pipeline, guidance will get clearer — and some early assumptions will likely change."
      }
    ]
  },
  "slug": "retatrutide",
  "outlook": {
    "outlook_text": "Retatrutide gets called the “next level” of GLP-1s because it’s built to push three signals at once: GLP-1, GIP, and glucagon. In plain language, people chase it for one main reason: appetite feels quieter, eating feels easier, and weight loss can move faster than expected.\n\nThe tradeoff is that the same lever that reduces intake can also make people under-eat without noticing. When that happens, the usual storyline isn’t just nausea — it’s low energy, weaker workouts, constipation/dehydration, and muscle loss if protein drops too far.\n\nBottom line: it’s an investigational compound with real human trial data behind the headline effects, but the long-term picture and best-fit populations are still being defined. Treat bold claims and aggressive stacking culture as noise until the evidence catches up.",
    "interest_bullets": [
      "Quiet “food noise” and make eating feel simpler",
      "Drive meaningful fat loss in an obesity/metabolic context",
      "Improve glucose control markers in research settings",
      "See whether “triple agonist” feels different than GLP-1 alone",
      "Lose fat without letting energy and lean mass collapse"
    ]
  }
}
